export const projectMok = {
  id: 1,
  name: "Техническая помощь проекту Камбаратинской ГЭС-1",
  sectors: [
    {
      id: 1,
      name: "Государственное управление",
      projectCount: 3,
    },
    {
      id: 4,
      name: "Инфраструктура и ресурсы",
      projectCount: 1,
    },
    {
      id: 9,
      name: "Государственное управление",
      projectCount: 1,
    },
    {
      id: 19,
      name: "Инфраструктура",
      projectCount: 6,
    },
    {
      id: 20,
      name: "Водоснабжение",
      projectCount: 32,
    },
    {
      id: 21,
      name: "Канализация и твердые бытовые отходы",
      projectCount: 1,
    },
    {
      id: 22,
      name: "Энергетика",
      projectCount: 16,
    },
    {
      id: 18,
      name: "Климат",
      projectCount: 2,
    },
    {
      id: 26,
      name: "Ирригация",
      projectCount: 1,
    },
    {
      id: 15,
      name: "Здравоохранение",
      projectCount: 1,
    }
  ],
  status: "In progress",
  partners: [
    {
      id: 1,
      name: "Агентство США по международному развитию - (USAID)",
      type: "partner",
      website: "https://www.usaid.gov/",
      fixedPhone: null,
      mobilePhone: null,
      address: null,
      projectCount: 1,
      grant: "5000000.00 USD",
      credit: "0 USD"
    },
    {
      id: 14,
      name: "Корейское агентство международного сотрудничества (KOICA)",
      identificationNumber: null,
      description: "Корейское агентство международного сотрудничества (KOICA) было основано в 1991 году для реализации корейских программ безвозмездной помощи и продвижения международного сотрудничества в сфере развития. Наша миссия заключается в решении глобальных проблем развития, содействии глобальной гармонии и поддержке устойчивого социально-экономического развития в странах-партнерах, с акцентом на сокращение бедности и улучшение качества жизни.\n\nKOICA имеет представительства в 47 странах по всему миру и служит платформой для развития сотрудничества, устанавливая партнерские отношения с различными заинтересованными сторонами, включая министерства, государственные учреждения, гражданское общество, бизнес и научные круги. Мы создаем глобальные сети путем запуска совместных проектов с агентствами ООН, чтобы укрепить национальный статус Кореи на мировой арене.\n\nНаша деятельность в Кыргызской Республике\n\nKOICA активно поддерживает Кыргызскую Республику в достижении Целей устойчивого развития (ЦУР) в соответствии с стратегиями KOICA и корейского правительства. В соответствии с национальной стратегией развития Кыргызской Республики и ключевыми направлениями сотрудничества, установленными в Стратегии странового партнерства на 2021-2025 годы, KOICA определила следующие приоритетные сектора и новые инициативы на 2021-2025 годы:\n\nЭффективное цифровое государственное управление\nИнклюзивное и устойчивое развитие сельских районов\nСоздание безопасного, здорового и зеленого общества\nПроекты\n1.1 Государственное управление\nДля содействия эффективному и прозрачному государственному управлению в Кыргызской Республике KOICA предоставляет поэтапную системную помощь, адаптированную к потребностям правительства Кыргызской Республики, создавая основу для цифрового правительства и расширения цифровизации в разных секторах.\n\nМодернизация и развитие потенциала системы электронного межведомственного взаимодействия \"ТУНДУК\" (2020-2025 / $5 млн.)\nЦель: Оптимизация государственных функций и услуг для граждан, повышение эффективности управления, внедрение полной электронной интероперабельности в систему государственного управления.\nМестный партнер: Министерство цифрового развития Кыргызской Республики, Государственное предприятие «Центр электронного взаимодействия».\nСоздание центра оперативного реагирования на компьютерные инциденты (SOC) в Кыргызской Республике (2021-2025 / $5 млн.)\nЦель: Усиление кибербезопасности путем создания центра оперативного реагирования в Национальном центре реагирования на компьютерные инциденты.\nМестный партнер: Государственный комитет Национальной безопасности Кыргызской Республики.\nЦифровизация Жогорку Кенеша (Парламента) Кыргызской Республики (2023-2027 / $8,5 млн.)\nЦель: Повышение эффективности и прозрачности законодательной деятельности через цифровизацию и улучшение подотчетности парламентских функций через программы наращивания потенциала.\nМестный партнер: Жогорку Кенеш (Парламент) Кыргызской Республики.\nПланируется: Наращивание потенциала Национальной системы для цифровой трансформации в Кыргызской Республике (2024-2027 / $7 млн.)\n\nЗавершено:\n\nПовышение потенциала избирательной системы в Кыргызской Республике (2014-2016 / $6,98 млн.)\nСоздание единой информационной системы управления земельными ресурсами в Кыргызской Республике (2015-2017 / $5 млн.)\nСоздание системы электронных удостоверений личности (e-NID) в Кыргызской Республике (2016-2017 / $7,46 млн.)\nПовышение уровня безопасности населения от пожаров путем усиления потенциала пожарно-спасательной службы в Кыргызской Республике (2019-2024 / $7,7 млн.)\n1.2 Сельское хозяйство\nKOICA содействует всестороннему развитию сельских районов, повышая продуктивность сельского хозяйства, расширяя сельскохозяйственную инфраструктуру, производя сельскохозяйственную продукцию с высокой добавленной стоимостью и развивая правовые системы и человеческие ресурсы.\n\nКомплексный проект развития сел Кыргызской Республики (2021-2025 / $8,8 млн.)\nЦель: Создать благоприятную социально-экономическую среду, повысить доходы домохозяйств мелких производителей и улучшить управление развитием сельских районов.\nМестный партнер: Министерство водных ресурсов, сельского хозяйства и перерабатывающей промышленности Кыргызской Республики.\nПовышение безопасности пищевых продуктов животного происхождения путем создания системы идентификации и отслеживания животных в Кыргызской Республике (2022-2026 / $5,5 млн.)\nЦель: Усилить безопасность продуктов животного происхождения с помощью интеллектуальной системы идентификации и отслеживания.\nМестный партнер: Ветеринарная служба при Министерстве водных ресурсов, сельского хозяйства и перерабатывающей промышленности Кыргызской Республики.\nГенетическое улучшение крупного рогатого скота и развитие искусственного осеменения в Кыргызской Республике (2023-2027 / $7,5 млн.)\nЦель: Повысить продуктивность крупного рогатого скота через восстановление научно-исследовательского института и программы генетического улучшения.\nМестный партнер: Кыргызский научно-исследовательский институт животноводства и пастбищ при Министерстве водных ресурсов, сельского хозяйства и перерабатывающей промышленности Кыргызской Республики.\nПланируется: Укрепление цепочки создания стоимости сельскохозяйственной продукции через системы послеуборочного управления в Кыргызстане (2024-2027 / $6 млн.)\n\nЗавершено:\n\nПроект \"Мое село\" в Кыргызской Республике (2019-2022 / $3,5 млн.)\nПоддержка политики органического сельского хозяйства и повышение потенциала фермеров в Кыргызстане (2019-2023 / $5 млн.)\n1.3 Энергетика и окружающая среда\nKOICA поддерживает разработку стратегий и политик в области охраны окружающей среды и изменения климата в Кыргызской Республике для содействия переходу к низкоуглеродной экономике и повышения способности к реагированию на изменения климата.\n\nРазвитие Национальной централизованной системы АСКУЭ для совершенствования энергетической системы Кыргызской Республики (2023-2026 / $10,5 млн.)\nЦель: Повышение эффективности распределения электроэнергии и снижение потерь в линиях электропередач.\nМестный партнер: Министерство энергетики Кыргызской Республики, ОАО \"Национальная энергетическая холдинговая компания\".\nПроект по переходу автопарка государственных служб на электромобили в рамках \"зеленой\" мобильности в Кыргызской Республике (2024-2027 / $11 млн.)\nЦель: Обеспечить электромобили и зарядные станции для государственных учреждений и создать инфраструктуру для адаптации к изменению климата, а также разработать план перехода на электромобили.\nМестный партнер: Министерство экономики и коммерции Кыргызской Республики, ОАО \"Кыргызпочтасы\".\nВолонтерская программа WFK (World Friends Korea)\nKOICA реализует двухлетнюю программу волонтеров за рубежом, отправляя волонтеров в более чем 50 областей, включая образование, здравоохранение, ИКТ, административную политику и развитие сельских поселений. В среднем 1600 волонтеров ежегодно служат по всему миру. В рамках программы WFK KOICA также направляет экспертов в страны-партнеры для обмена знаниями в области администрации, образования, здравоохранения и других.\n\nЕжегодно в Кыргызстан отправляется в среднем 15 корейских волонтеров и экспертов, которые вносят вклад в области образования, государственного управления, ИТ, здравоохранения и развития молодежи.\n\nПрограмма обучения KOICA CIAT\nПрограмма обучения CIAT (Capacity Improvement and Advancement for Tomorrow) является одним из основных направлений KOICA по поддержке стран-партнеров в обеспечении человеческих ресурсов для их развития. Цель программы — обмен техническими навыками и знаниями, а также наращивание потенциала для устойчивого социально-экономического развития. Обучение проводится на страновом, региональном и глобальном уровнях, включая стипендии для магистратуры и докторантуры.\n\nС 1993 года около 1000 государственных служащих из Кыргызстана прошли обучение по программе CIAT в таких областях, как государственное управление, экология, энергетика, сельское хозяйство и другие.",
      type: "partner",
      website: "https://www.koica.go.kr/sites/kgz_en/index.do",
      fixedPhone: "+996 (312) 979 401/402/403",
      mobilePhone: null,
      address: null,
      projectCount: 1,
      grant: "5000000.00 USD",
      credit: "0 USD"
    }
  ],
  funding: {
    totalSum: "0.00 USD",
    "coFundingSum": "0.00 USD",
    "techAidSum": null,
    "fundsSpent": "0.00 USD",
    "fundsSpentCurrentYear": "0.00 USD",
    "items": [
      {
        "partnerName": null,
        type: "Grant",
        "number": "123123123",
        totalSum: "0.00 KGS",
        "totalSumForeign": "5000000.00 USD"
      }
    ]
  },
  address: [
    {
      id: null,
      region: {
        id: 5,
        name: "Джалал-Абадская область",
        "district": null,
        projectCount: 0
      },
      "district": null,
      "city": null,
      "streetStr": null,
      coordinates: null
    },
    {
      id: null,
      region: {
        id: 2,
        name: "Ошская область",
        "district": null,
        projectCount: 0
      },
      "district": {
        id: 14,
        name: "Кара-Кульджинский район",
        "city": null,
        projectCount: 0
      },
      "city": null,
      "streetStr": null,
      coordinates: null
    },
    {
      id: null,
      region: {
        id: 8,
        name: "город Бишкек",
        "district": null,
        projectCount: 0
      },
      "district": null,
      "city": null,
      "streetStr": null,
      coordinates: [
        74.553738,
        42.873196
      ]
    }
  ],
  "startDate": "2021-01-01",
  endDate: "2023-04-01",
  totalSum: "0.00 USD"
};