export const IconsEnum = {
  Водоснабжение: "3",
  Транспорт: "3",
  Энергетика: "4",
  "Сельское хозяйство": "1",
  Здравоохранение: "3",
  "Социальные обеспечения": "1",
  "Чрезвычайная ситуация": "3",
  Образование: "2",
  "Водоснабжение, Инфраструктура": "6",
  "Социальное жилье и ипотека": "4",
  "Государственное управление": "6",
  "Сельское хозяйство, Энергетика, Социальные обеспечения": "2",
  "Здравоохранение, Сельское хозяйство": "2",
  "Сельское хозяйство, Социальные обеспечения": "2",
  Климат: "5",
  "Канализация и Твердые бытовые отходы": "4",
  "Инфраструктура, Сельское хозяйство": "4",
  Инфраструктура: "4",
  "Международная ассоциация развития (МАР)": "6",
  "Азиатский Банк Развития": "6",
  "Саудовский фонд развития": "6",
  "Европейский Банк Реконструкции и Развития": "6",
  "Всемирный банк": "6",
  "Исламский банк развития (ИБР)": "6",
  "Исламский банк развития (ИБР), Саудовский фонд развития": "6",
  "Германский Банк Развития (KfW)": "6",
  "Европейский инвестиционный банк (ЕИБ)": "6",
  "Японское агентство международного сотрудничества": "6",
  "Европейский Банк Реконструкции и Развития, Европейский инвестиционный банк (ЕИБ)": "6",
  "Всемирный банк, Международная ассоциация развития (МАР)": "6",
  "Экспортно-импортный банк Китая": "6",
  "Евразийский банк развития(ЕАБР)": "6",
  "Фонд международного развития ОПЕК": "6",
  "Азиатский Банк Развития, Международная ассоциация развития (МАР)": "6",
  "Экспортно-импортного банка Кореи (Korea Eximbank)": "6",
  "Кувейтский Фонд Арабского Экономического Развития": "6",
  "Европейский Банк Реконструкции и Развития, Государственный секретариат по экономическим делам Швейцарии (SECO)": "6",
  "Европейский Банк Реконструкции и Развития, Европейский инвестиционный банк (ЕИБ), Евразийский банк развития(ЕАБР)":
    "6",
  "Азиатский Банк Развития, Евразийский банк развития(ЕАБР)": "6",
};

export const TestFilterSectorOptions = [
  {
    id: 1,
    name: "Здравоохранение",
  },
  {
    id: 2,
    name: "Образование",
  },
  {
    id: 3,
    name: "Транспорт",
  },
  {
    id: 4,
    name: "Энергетика",
  },
  {
    id: 5,
    name: "Сельское хозяйство",
  },
  {
    id: 6,
    name: "Информационные технологии",
  },
  {
    id: 7,
    name: "Экология",
  },
  {
    id: 8,
    name: "Строительство",
  },
  {
    id: 9,
    name: "Наука и технологии",
  },
  {
    id: 10,
    name: "Городское развитие",
  },
];

export const TestFilterLocationNameOptions = [
  {
    id: 1,
    name: "Нарынская область",
  },
  {
    id: 2,
    name: "Чуйская область",
  },
  {
    id: 3,
    name: "Ошская область",
  },
  {
    id: 4,
    name: "Иссык-Кульская область",
  },
  {
    id: 5,
    name: "Таласская область",
  },
  {
    id: 6,
    name: "Джалал-Абадская область",
  },
  {
    id: 7,
    name: "Баткенская область",
  },
  {
    id: 8,
    name: "Город Бишкек",
  },
  {
    id: 9,
    name: "Город Ош",
  },
  {
    id: 10,
    name: "Город Токмак",
  },
];

export const TestFilterDonorOptions = [
  {
    id: 1,
    name: "Банк Европейского развития",
  },
  {
    id: 2,
    name: "Всемирный банк",
  },
  {
    id: 3,
    name: "Американское агентство международного развития (USAID)",
  },
  {
    id: 4,
    name: "Германское общество международного сотрудничества (GIZ)",
  },
  {
    id: 5,
    name: "Европейская комиссия",
  },
  {
    id: 6,
    name: "Фонд Форда",
  },
  {
    id: 7,
    name: "Британская международная программа помощи (DFID)",
  },
  {
    id: 8,
    name: "Международный фонд ООН для оказания помощи",
  },
  {
    id: 9,
    name: 'Фонд "Сорос-Кыргызстан"',
  },
  {
    id: 10,
    name: "Азиатский банк развития",
  },
];

export const TestProjects = [
  {
    type: "Feature",
    properties: {
      id: 179,
      name: "Техническая помощь проекту Камбаратинской ГЭС-1",
      totalFinancingUsd: 5000000.0,
      financingPerLocation: 2500000.0,
      endDate: "2027-12-31T00:00:00",
      donors: ["Международная ассоциация развития (МАР)"],
      sectors: ["Энергетика"],
      location_name: "Кыргызская Республика",
    },
    geometry: {
      type: "Point",
      coordinates: [74.553738, 42.873196],
    },
  },
  {
    type: "Feature",
    properties: {
      id: 180,
      name: "Проект развития здравоохранения в Кыргызстане",
      totalFinancingUsd: 3000000.0,
      financingPerLocation: 1500000.0,
      endDate: "2025-06-30T00:00:00",
      donors: ["Всемирный банк"],
      sectors: ["Здравоохранение"],
      location_name: "Чуйская область",
    },
    geometry: {
      type: "Point",
      coordinates: [74.583738, 42.975196],
    },
  },
  {
    type: "Feature",
    properties: {
      id: 181,
      name: "Развитие инфраструктуры на юге Кыргызстана",
      totalFinancingUsd: 8000000.0,
      financingPerLocation: 4000000.0,
      endDate: "2026-12-31T00:00:00",
      donors: ["Германское общество международного сотрудничества (GIZ)"],
      sectors: ["Транспорт"],
      location_name: "Ошская область",
    },
    geometry: {
      type: "Point",
      coordinates: [73.550738, 40.550196],
    },
  },
  {
    type: "Feature",
    properties: {
      id: 182,
      name: "Поддержка инновационных технологий в Кыргызстане",
      totalFinancingUsd: 1000000.0,
      financingPerLocation: 500000.0,
      endDate: "2024-11-30T00:00:00",
      donors: ["Банк Европейского развития"],
      sectors: ["Информационные технологии"],
      location_name: "Город Бишкек",
    },
    geometry: {
      type: "Point",
      coordinates: [74.616738, 42.878196],
    },
  },
  {
    type: "Feature",
    properties: {
      id: 183,
      name: "Проект устойчивого развития сельского хозяйства",
      totalFinancingUsd: 4000000.0,
      financingPerLocation: 2000000.0,
      endDate: "2025-12-31T00:00:00",
      donors: ["Азиатский банк развития"],
      sectors: ["Сельское хозяйство"],
      location_name: "Таласская область",
    },
    geometry: {
      type: "Point",
      coordinates: [72.920738, 42.375196],
    },
  },
  {
    type: "Feature",
    properties: {
      id: 184,
      name: "Образовательный проект для молодежи",
      totalFinancingUsd: 2000000.0,
      financingPerLocation: 1000000.0,
      endDate: "2023-12-31T00:00:00",
      donors: ["Фонд Форда"],
      sectors: ["Образование"],
      location_name: "Город Токмак",
    },
    geometry: {
      type: "Point",
      coordinates: [72.858738, 42.952196],
    },
  },
  {
    type: "Feature",
    properties: {
      id: 185,
      name: "Проект по улучшению городской инфраструктуры",
      totalFinancingUsd: 6000000.0,
      financingPerLocation: 3000000.0,
      endDate: "2028-01-31T00:00:00",
      donors: ["Международный фонд ООН для оказания помощи"],
      sectors: ["Городское развитие"],
      location_name: "Город Бишкек",
    },
    geometry: {
      type: "Point",
      coordinates: [74.595738, 42.874196],
    },
  },
  {
    type: "Feature",
    properties: {
      id: 186,
      name: "Экологический проект по восстановлению экосистем",
      totalFinancingUsd: 7000000.0,
      financingPerLocation: 3500000.0,
      endDate: "2029-05-15T00:00:00",
      donors: ["Европейская комиссия"],
      sectors: ["Экология"],
      location_name: "Иссык-Кульская область",
    },
    geometry: {
      type: "Point",
      coordinates: [77.061738, 42.270196],
    },
  },
];
